Repository: JoergAlthoff/JwaBolus
Catalog: JwaBolus/*.lproj/Localizable.strings
Languages: de, uk

# app.title
source: Bolus Calculator
de: Bolusrechner
uk: Калькулятор болюсу

source: Done
de: Fertig
uk: Готово

source: Invalid input
de: Ungültige Eingabe
uk: Недійсне введення

source: Settings
de: Einstellungen
uk: Налаштування

# startButton.title
source: Start
uk: Почати

# bgunit.mgdl
source: mg/dL
uk: мг/дл

# bgunit.mmol
source: mmol/L
uk: ммоль/л

# bgunit.picker.label
source: Unit
de: Einheit
uk: Одиниця

# bgunit.section.title
source: Blood Glucose Unit
de: Blutzuckereinheit
uk: Одиниця рівня глюкози

# input.bg.title
source: Current BG in %@
de: Aktueller BZ in %@
uk: Поточний рівень глюкози у %@

# input.carbohydrates.title
source: Carbohydrates in %@
de: Kohlenhydrate in %@
uk: Вуглеводи у %@

source: Target BG
de: Ziel-BZ
uk: Цільовий рівень глюкози

# targetBG.title
source: Target BG (%@)
de: Ziel-BZ (%@)
uk: Цільовий рівень глюкози (%@)

source: Correction Factor
de: Korrekturfaktor
uk: Коефіцієнт корекції

# correctionFactor.title
source: Correction Factor (%@)
de: Korrekturfaktor (%@)
uk: Коефіцієнт корекції (%@)

# mealFactor
source: Meal Insulin
de: Mahlzeiten-Insulin
uk: Інсулін до їжі

# mealFactor.title
source: Meal Insulin
de: Mahlzeiten-Insulin
uk: Інсулін до їжі

# saved.insulin.time
source: Saved %@ hours ago
de: Gespeichert vor %@ Stunden
uk: Збережено %@ годин тому

# insulin.section.title
source: Insulin Duration & Reset
de: Insulin Wirkdauer & Reset
uk: Тривалість інсуліну та скидання

# resetInsulin.button.title
source: Reset Remaining Insulin
de: Restinsulin zurücksetzen
uk: Скинути залишок інсуліну

# applyMorning.button.title
source: Apply morning settings to all time periods
de: Einstellungen von Früh für alle Tageszeiten übernehmen
uk: Застосувати ранкові налаштування до всіх періодів

# results.headline
source: Units (IU) by time of day
de: Einheiten (IE) nach Tageszeit
uk: Одиниці (ОД) за часом доби

# results.footnote
source: The buttons Morning to Night save the value for remaining insulin calculation
de: Die Tasten Früh bis Nacht speichern den Wert für die Restinsulinberechnung
uk: Кнопки від Ранку до Ночі зберігають значення для розрахунку залишкового інсуліну

# timePeriod.morning
source: Morning
de: Früh
uk: Ранок

# timePeriod.noon
source: Noon
de: Mittag
uk: День

# timePeriod.evening
source: Evening
de: Abend
uk: Вечір

# timePeriod.night
source: Night
de: Nacht
uk: Ніч

# sport.menu.title
source: Sport within 2 hours:
de: Sport innerhalb von 2 Stunden:
uk: Спорт протягом 2 годин:

# sportintensity.none
source: No sport
de: Kein Sport
uk: Без спорту

# sportintensity.light
source: Light exercise
de: Leichter Sport
uk: Легке фізичне навантаження

# sportintensity.moderate
source: Moderate exercise
de: Moderater Sport
uk: Помірне фізичне навантаження

# sportintensity.intense
source: Intense exercise
de: Intensiver Sport
uk: Інтенсивне фізичне навантаження

# accessibility.done
source: Close
de: Schließen
uk: Закрити

# accessibility.hint.info
source: Opens help and legal information
de: Öffnet die Hilfe mit rechtlichen Hinweisen und Anleitungen
uk: Відкриває довідку та юридичну інформацію

# accessibility.hint.settings
source: Opens settings to customize your parameters
de: Öffnet die Einstellungen zur Anpassung der Werte
uk: Відкриває налаштування для зміни параметрів

# accessibility.hint.startButton
source: Calculates the recommended insulin dose
de: Berechnet die empfohlene Insulindosis
uk: Обчислює рекомендовану дозу інсуліну

# accessibility.hint.resultButton
source: Saves the value for remaining insulin calculation
de: Speichert den Wert zur Restinsulinberechnung
uk: Зберігає значення для розрахунку залишкового інсуліну

# accessibility.hint.resultButton.morning
source: Saves the result for the morning period to calculate remaining insulin
de: Speichert das Ergebnis für den Zeitraum morgens zur Restinsulinberechnung
uk: Зберігає результат для ранкового періоду

# accessibility.hint.resultButton.noon
source: Saves the result for the noon period to calculate remaining insulin
de: Speichert das Ergebnis für den Zeitraum mittags zur Restinsulinberechnung
uk: Зберігає результат для полуденного періоду

# accessibility.hint.resultButton.evening
source: Saves the result for the evening period to calculate remaining insulin
de: Speichert das Ergebnis für den Zeitraum abends zur Restinsulinberechnung
uk: Зберігає результат для вечірнього періоду

# accessibility.hint.resultButton.night
source: Saves the result for the night period to calculate remaining insulin
de: Speichert das Ergebnis für den Zeitraum nachts zur Restinsulinberechnung
uk: Зберігає результат для нічного періоду

# accessibility.hint.applyMorning
source: Copies the morning settings to all time periods
de: Kopiert die Früh-Einstellungen auf alle Tageszeiten
uk: Копіює ранкові налаштування на всі періоди

# accessibility.hint.resetInsulin
source: Resets the stored remaining insulin value
de: Setzt den gespeicherten Restinsulinwert auf null zurück
uk: Обнуляє збережене значення залишкового інсуліну

# accessibility.hint.expandSection
source: Tap to show values for this time period
de: Tippen zum Anzeigen der Werte für diese Tageszeit
uk: Натисніть, щоб показати значення

# accessibility.hint.collapseSection
source: Tap to hide values for this time period
de: Tippen zum Ausblenden der Werte für diese Tageszeit
uk: Натисніть, щоб приховати значення

# accessibility.hint.initialSetup.done
source: Completes the setup and shows the main interface
de: Beendet die Ersteinrichtung und zeigt die App-Oberfläche
uk: Завершує початкове налаштування та відкриває головний інтерфейс

# accessibility.hint.done
source: Closes the settings and returns
de: Schließt die Einstellungen und kehrt zurück
uk: Закриває налаштування та повертає назад

# accessibility.hint.chevron.expand
source: Tap to show input fields for this time period
de: Tippe, um die Eingabefelder anzuzeigen
uk: Показати поля введення для цього періоду

# accessibility.hint.chevron.collapse
source: Tap to hide input fields for this time period
de: Tippe, um die Eingabefelder auszublenden
uk: Сховати поля введення для цього періоду

# accessibility.info
source: Show information
de: Info anzeigen
uk: Показати інформацію

# accessibility.settings
source: Open settings
de: Einstellungen öffnen
uk: Відкрити налаштування

# accessibility.startButton
source: Start calculation
de: Berechnung starten
uk: Почати розрахунок

# accessibility.applyMorning
source: Apply morning settings to all
de: Morgeneinstellungen auf alle übernehmen
uk: Застосувати ранкові налаштування до всіх

# accessibility.resetInsulin
source: Reset remaining insulin
de: Restinsulin zurücksetzen
uk: Скинути залишковий інсулін

# accessibility.sport.menu
source: Select sport intensity
de: Sport auswählen
uk: Оберіть рівень фізичного навантаження

# accessibility.sportintensity.none
source: No sport
de: Kein Sport
uk: Без спорту

# accessibility.sportintensity.light
source: Light exercise
de: Leichter Sport
uk: Легке фізичне навантаження

# accessibility.sportintensity.moderate
source: Moderate exercise
de: Moderater Sport
uk: Помірне фізичне навантаження

# accessibility.sportintensity.intense
source: Intense exercise
de: Intensiver Sport
uk: Інтенсивне фізичне навантаження

# accessibility.saveResultButton.morning
source: Save remaining insulin for morning
de: Restinsulin für morgens speichern
uk: Зберегти для ранку

# accessibility.saveResultButton.noon
source: Save remaining insulin for noon
de: Restinsulin für mittags speichern
uk: Зберегти для полудня

# accessibility.saveResultButton.evening
source: Save remaining insulin for evening
de: Restinsulin für abends speichern
uk: Зберегти для вечора

# accessibility.saveResultButton.night
source: Save remaining insulin for night
de: Restinsulin für nachts speichern
uk: Зберегти для ночі

# accessibility.initial.setup.done
source: Finish initial setup
de: Fertig mit der Ersteinrichtung
uk: Завершити початкове налаштування

# accessibility.initial.setup.done.hint
source: Completes the initial setup and returns to the main view.
uk: Завершує початкове налаштування та повертає на головний екран

# accessibility.chevron.expand
source: Expand section
de: Abschnitt ausklappen
uk: Розгорнути секцію

# accessibility.chevron.collapse
source: Collapse section
de: Abschnitt einklappen
uk: Згорнути секцію

# initial.setup.title
source: Welcome to JwaBolus!
de: Willkommen bei JwaBolus!
uk: Ласкаво просимо до JwaBolus!

# initial.setup.message
source: Please review and configure your personal settings first. This is important to ensure accurate calculations.
de: Bitte überprüfe und konfiguriere zunächst deine persönlichen Einstellungen. Dies ist wichtig, um korrekte Berechnungen sicherzustellen.
uk: Будь ласка, спершу перевірте та налаштуйте ваші персональні параметри. Це важливо для точних розрахунків.

# initial.setup.goToSettings
source: Open Settings
de: Einstellungen öffnen
uk: Відкрити налаштування

# initial.setup.done
source: Done
de: Fertig
uk: Готово

# initial.setup.navigationTitle
source: Initial Setup
de: Ersteinrichtung
uk: Початкове налаштування

# initial.setup.disclaimer
source: This app was created as a learning tool and personal project. It is not a medical device and does not provide medical diagnosis, treatment, or monitoring. Use it at your own risk. Always consult a healthcare professional or diabetes advisor for medical decisions.
de: Diese App wurde als Lernhilfe und persönliches Projekt erstellt. Sie ist kein Medizinprodukt und dient nicht zur medizinischen Diagnose, Behandlung oder Überwachung. Die Nutzung erfolgt vollständig auf eigene Gefahr. Bitte konsultiere bei gesundheitlichen Fragen stets eine ärztliche Fachperson oder deinen Diabetesberater.
uk: Цей додаток створено як навчальний інструмент і особистий проєкт. Він не є медичним пристроєм і не надає діагностики, лікування або моніторингу. Користуйтеся на власний ризик. Завжди консультуйтеся з лікарем або фахівцем із діабету для медичних рішень.

# help.navTitle
source: Help & Info
de: Hilfe & Info
uk: Довідка та інформація

# help.title.purpose
source: 📝 Purpose of the App
de: 📝 Zweck der App
uk: 📝 Призначення додатку

# help.content.purpose
source: This app is a learning tool for calculating insulin dosage. It is not a medical device.
de: Diese App ist eine Lernhilfe zur Berechnung der Insulindosis. Sie ist kein Medizinprodukt.
uk: Цей додаток є навчальним інструментом для розрахунку дози інсуліну. Він не є медичним пристроєм.

# help.title.logic
source: 📊 Calculation Logic
de: 📊 Berechnungslogik
uk: 📊 Логіка розрахунку

# help.content.logic
source: Insulin dose = ((BG - target) ÷ correction factor + (carbs ÷ carb factor)) × sport factor
de: Insulinbedarf = ((BZ - Zielwert) ÷ Korrekturfaktor + (KH ÷ KH-Faktor)) × Sportfaktor
uk: Доза інсуліну = ((ГК - ціль) ÷ коефіцієнт корекції + (вуглеводи ÷ коефіцієнт вуглеводів)) × коефіцієнт спорту

# help.title.disclaimer
source: ⚠️ Disclaimer
de: ⚠️ Haftungshinweis
uk: ⚠️ Відмова від відповідальності

# help.content.disclaimer
source: This app is not a medical device. Use at your own risk.
de: Diese App ist kein Medizinprodukt. Die Nutzung erfolgt auf eigene Gefahr.
uk: Цей додаток не є медичним пристроєм. Використовуйте на власний ризик.

# help.title.privacy
source: 🛡️ Privacy
de: 🛡️ Datenschutz
uk: 🛡️ Конфіденційність

# help.content.privacy
source: All data remains on your device. No internet connection is used.
de: Alle Daten verbleiben auf deinem Gerät. Es wird keine Internetverbindung verwendet.
uk: Всі дані залишаються на вашому пристрої. Інтернет-з'єднання не використовується.

# help.title.sport
source: 🏃‍♂️ Sport Factor
de: 🏃‍♂️ Sportfaktor
uk: 🏃‍♂️ Коефіцієнт спорту

# help.content.sport
source: The calculated insulin dose is adjusted based on activity level: • no sport = 1.0 • light sport = 0.75 • moderate sport = 0.67 • intense sport = 0.5.
de: Je nach Sportintensität wird der berechnete Insulinbedarf angepasst: • kein Sport = 1.0 • leichter Sport = 0.75 • moderater Sport = 0.67 • intensiver Sport = 0.5.
uk: Розрахована доза інсуліну коригується залежно від рівня активності: • без спорту = 1.0 • легкий спорт = 0.75 • помірний спорт = 0.67 • інтенсивний спорт = 0.5.

# help.title.usage
source: ⚙️ Usage
de: ⚙️ Bedienung
uk: ⚙️ Використання

# help.content.usage
source: Enter your current blood glucose and carbohydrates. Tap Start to calculate the insulin dose. Tap a result to save it for remaining insulin calculation. Remaining insulin is estimated linearly based on your entered duration.
de: Trage deinen aktuellen Blutzuckerwert und die Kohlenhydrate ein. Tippe auf Start, um die Insulindosis zu berechnen. Tippe auf ein Ergebnis, um es für die Restinsulinberechnung zu speichern. Das Restinsulin wird basierend auf der eingegebenen Wirkungsdauer linear geschätzt.
uk: Введіть поточний рівень глюкози та вуглеводи. Натисніть «Почати» для розрахунку дози інсуліну. Натисніть на результат, щоб зберегти його для розрахунку залишкового інсуліну. Залишковий інсулін розраховується лінійно на основі введеної тривалості.

# help.title.tips
source: 💡 Tips
de: 💡 Tipps
uk: 💡 Поради

# help.content.tips
source: Regularly check your blood glucose to avoid over- or underdosing. Adjust your correction and carb factors if your sensitivity changes. Keep in mind that exercise or stress can influence your blood glucose.
de: Überprüfe regelmäßig deinen Blutzucker, um Über- oder Unterdosierungen zu vermeiden. Passe deine Korrektur- und Kohlenhydratfaktoren an, wenn sich deine Insulinempfindlichkeit verändert. Denke daran, dass Sport oder Stress deinen Blutzucker beeinflussen können.
uk: Регулярно перевіряйте рівень глюкози, щоб уникнути передозування або недоотримання інсуліну. За змін чутливості корегуйте коефіцієнти. Пам’ятайте, що фізичне навантаження або стрес можуть впливати на рівень глюкози.

# help.title.license
source: 📜 License
de: 📜 Lizenz
uk: 📜 Ліцензія

# help.content.license
source: Show GNU License
de: GNU-Lizenz anzeigen
uk: Показати ліцензію GNU

# remaining.insulin.iu
source: Remaining insulin approx. %.1f IU
de: Restinsulin ca. %.1f IE
